{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hi",
                "Hello",
                "Hey",
                "How are you"
            ],
            "responses": [
                "Hi there",
                "Hello",
                "Hey",
                "I'm fine, thank you",
                "Nothing much"
            ]
        },
        {
            "tag": "goodbye",
            "patterns": [
                "Bye",
                "See you later",
                "Goodbye",
                "Take care"
            ],
            "responses": [
                "Goodbye",
                "See you later",
                "Take care"
            ]
        },
        {
            "tag": "thanks",
            "patterns": [
                "Thank you",
                "Thanks",
                "Thanks a lot"
            ],
            "responses": [
                "You're welcome",
                "No problem",
                "Glad I could help"
            ]
        },
        {
            "tag": "about",
            "patterns": [
                "you do",
                "Who are you"
            ],
            "responses": [
                "I am a chatbot My purpose is to assist you",
                "I can answer questions and provide assistance"
            ]
        },
        {
            "tag": "help",
            "patterns": [
                "Help",
                "need help",
                "help me"
            ],
            "responses": [
                "Sure, what do you need help with?",
                "I'm here to help. What's the problem?",
                "How can I assist you?"
            ]
        },
        {
            "tag": "age",
            "patterns": [
                "your age"
            ],
            "responses": [
                "I don't have an age. I'm a chatbot.",
                "I was just born in the digital world.",
                "Age is just a number for me."
            ]
        },
        {
            "tag": "weather",
            "patterns": [
                "weather today"
            ],
            "responses": [
                "I'm sorry, I cannot provide real-time weather information.",
                "You can check the weather on a weather app or website."
            ]
        },
        {
            "tag": "budget",
            "patterns": [
                "make budget",
                "budgeting strategy",
                "create budget"
            ],
            "responses": [
                "To make a budget, start by tracking your income and expenses. Then, allocate your income towards essential expenses like rent, food, and bills. Next, allocate some of your income towards savings and debt repayment. Finally, allocate the remainder of your income towards discretionary expenses like entertainment and hobbies.",
                "A good budgeting strategy is to use the 50/30/20 rule. This means allocating 50% of your income towards essential expenses, 30% towards discretionary expenses, and 20% towards savings and debt repayment.",
                "To create a budget, start by setting financial goals for yourself. Then, track your income and expenses for a few months to get a sense of where your money is going. Next, create a budget by allocating your income towards essential expenses, savings and debt repayment, and discretionary expenses."
            ]
        },
        {
            "tag": "name",
            "patterns": [
                "your name",
                "Do you have a name"
            ],
            "responses": [
                "You can call me Nyaya Sevika.",
                "My name is e Nyaya Sevika."
            ]
        },
        {
            "tag": "time",
            "patterns": [
                "time"
            ],
            "responses": [
                "I'm sorry, but I don't have access to real-time information like the current time.",
                "You can check the time on your device or use a clock."
            ]
        },
        {
            "tag": "technology",
            "patterns": [
                "latest tech news",
                "technology"
            ],
            "responses": [
                "You can refer to our current affairs section"
            ]
        },
        {
            "tag": "compliment",
            "patterns": [
                "awesome",
                "great"
            ],
            "responses": [
                "Thank you! I'm just a program, but I'm here to assist and make your experience better.",
                "I'm glad you think so! My purpose is to help and provide useful information.",
                "Thank you! It is my duty to serve the humanity."
            ]
        },
        {
            "tag": "sports",
            "patterns": [
                "sports",
                "sports news"
            ],
            "responses": [
                "You can refer to our current affairs section"
            ]
        },
        {
            "tag": "books",
            "patterns": [
                "favorite book"
            ],
            "responses": [
                "My favourite book is The Indian Constitution"
            ]
        },
        {
            "tag": "education",
            "patterns": [
                "education"
            ],
            "responses": [
                "Education is the process of acquiring knowledge, skills, values, and attitudes. It plays a crucial role in personal and societal development.",
                "Studying effectively involves setting clear goals, creating a conducive study environment, staying organized, taking regular breaks, and seeking help when needed."
            ]
        },
        {
            "tag": "coding",
            "patterns": [
                "coding",
                "programming language"
            ],
            "responses": [
                "Coding is the process of writing instructions for computers to execute tasks. It powers software, websites, and apps.",
                "If you want to start coding, choose a programming language like Python, Java, or JavaScript, and explore online tutorials and courses."
            ]
        },
        {
            "tag": "art",
            "patterns": [
                "art",
                "artwork"
            ],
            "responses": [
                "Art comes in various forms, such as paintings, sculptures, music, literature, and more. It's a way to express emotions and ideas.",
                "Appreciating art involves being open-minded, observing details, understanding the context, and exploring different art movements."
            ]
        },
        {
            "tag": "career",
            "patterns": [
                "job",
                "career development"
            ],
            "responses": [
                "To find a job, identify your skills and interests, create a compelling resume, network, and apply to suitable positions.",
                "Career development involves setting goals, continuous learning, seeking mentorship, and adapting to the evolving job market."
            ]
        },
        {
            "tag": "technology_help",
            "patterns": [
                "technology",
                "tech support"
            ],
            "responses": [
                "As an AI chatbot, I can provide information and basic troubleshooting for common technology problems.",
                "For complex technical issues, it's best to consult a qualified IT professional."
            ]
        },
        {
            "tag": "history",
            "patterns": [
                " history event"
            ],
            "responses": [
                "My favourite historical event is Indian Independence"
            ]
        },
        {
            "tag": "science",
            "patterns": [
                "science"
            ],
            "responses": [
                "Science is the systematic study of the natural world, aiming to understand phenomena and make discoveries.",
                "Science has led to advancements in medicine, technology, agriculture, and our understanding of the universe."
            ]
        },
        {
            "tag": "finance_tips",
            "patterns": [
                "finance tips",
                "Investment advice"
            ],
            "responses": [
                "Finance tips include budgeting, saving a portion of your income, avoiding unnecessary expenses, and investing wisely for the future.",
                "Investing in stocks, mutual funds, or real estate can help grow your wealth over time."
            ]
        },
        {
            "tag": "artificial_intelligence",
            "patterns": [
                "artificial intelligence",
                "AI"
            ],
            "responses": [
                "Artificial intelligence is the simulation of human intelligence in machines, enabling them to learn and perform tasks.",
                "AI has diverse applications, including voice assistants, self-driving cars, recommendation systems, and medical diagnostics."
            ]
        },
        {
            "tag": "motivation",
            "patterns": [
                "motivation"
            ],
            "responses": [
                "Believe in yourself. You have the strength to overcome any obstacle and achieve your dreams!",
                "Obstacles are stepping stones to success. Embrace challenges as opportunities for growth and learning."
            ]
        },
        {
            "tag": "future",
            "patterns": [
                "future"
            ],
            "responses": [
                "The future is uncertain, but advancements in technology, medicine, and space exploration hold great potential.",
                "The future of technology may include AI advancements, renewable energy solutions, and even the possibility of space colonization."
            ]
        },
        {
            "tag": "robotics",
            "patterns": [
                "robotics"
            ],
            "responses": [
                "Robotics is the study and development of robots, which are machines capable of performing tasks autonomously or semi-autonomously.",
                "The future of robotics may include advancements in AI, human-robot collaboration, and robotics in industries like healthcare and manufacturing."
            ]
        },
        {
            "tag": "coding_languages",
            "patterns": [
                "coding languages",
                "programming language"
            ],
            "responses": [
                "Coding languages include Python, Java, JavaScript, C++, and more. The choice depends on your interests and the application you want to develop.",
                "Python is often recommended for beginners due to its readability and versatility."
            ]
        },
        {
            "tag": "virtual_reality",
            "patterns": [
                "VR work",
                "virtual reality"
            ],
            "responses": [
                "Virtual reality is a computer-generated simulation that allows users to interact with a 3D environment.",
                "VR has applications in gaming, training, education, architecture, and therapeutic interventions."
            ]
        },
        {
            "tag": "cybersecurity",
            "patterns": [
                "cybersecurity"
            ],
            "responses": [
                "Cybersecurity involves protecting computers, networks, and data from unauthorized access, attacks, and damage.",
                "Best practices include using strong passwords, keeping software updated, avoiding suspicious links, and using antivirus software."
            ]
        },
        {
            "tag": "futuristic_technology",
            "patterns": [
                "futuristic technology"
            ],
            "responses": [
                "Futuristic technology may include advancements in AI, nanotechnology, biotechnology, quantum computing, and space exploration.",
                "Predicting the exact state of technology in the future is challenging, but progress is expected to be exponential."
            ]
        },
        {
            "tag": "universe",
            "patterns": [
                "universe"
            ],
            "responses": [
                "The universe is vast, containing billions of galaxies, each with billions of stars.",
                "Astrology is the study of celestial bodies' influence on human affairs, while astronomy is the scientific study of celestial objects and phenomena."
            ]
        },
        {
            "tag": "social_media",
            "patterns": [
                "social media"
            ],
            "responses": [
                "Social media platforms allow people to connect, share content, and stay updated on news and events.",
                "Using social media responsibly involves protecting privacy, avoiding misinformation, and fostering positive interactions."
            ]
        },
        {
            "tag": "happiness",
            "patterns": [
                "happiness"
            ],
            "responses": [
                "Happiness is a subjective and individual experience, and it can be found in meaningful relationships, personal achievements, and gratitude.",
                "Focusing on positive aspects, practicing mindfulness, and helping others contribute to a happier life."
            ]
        },
        {
            "tag": "self_care",
            "patterns": [
                "self-care"
            ],
            "responses": [
                "Self-care involves taking care of one's physical, emotional, and mental well-being.",
                "Prioritizing self-care can lead to improved overall health and a more balanced lifestyle."
            ]
        },
        {
            "tag": "augmented_reality",
            "patterns": [
                "augmented reality",
                "AR",
                "ar"
            ],
            "responses": [
                "Augmented reality overlays digital content onto the real world, enhancing the user's experience.",
                "AR has applications in gaming, education, retail, and industrial training."
            ]
        },
        {
            "tag": "global_warming",
            "patterns": [
                "global warming",
                "Climate change"
            ],
            "responses": [
                "Global warming refers to the long-term increase in Earth's average temperature due to human activities, primarily the burning of fossil fuels.",
                "Reducing carbon footprint involves energy conservation, using renewable energy sources, and supporting eco-friendly practices."
            ]
        },
        {
            "tag": "data_privacy",
            "patterns": [
                "data privacy"
            ],
            "responses": [
                "Data privacy refers to safeguarding personal and sensitive information from unauthorized access and misuse.",
                "Protecting personal information online involves using strong passwords, enabling two-factor authentication, and being cautious about sharing sensitive data."
            ]
        },
        {
            "tag": "virtual_assistant",
            "patterns": [
                "virtual assistants"
            ],
            "responses": [
                "Virtual assistants are AI-powered programs that perform tasks and provide information through natural language interaction.",
                "Popular virtual assistants include Siri, Alexa, Google Assistant, and Cortana."
            ]
        },
        {
            "tag": "emerging_technologies",
            "patterns": [
                "emerging technologies"
            ],
            "responses": [
                "Emerging technologies include 5G, blockchain, quantum computing, biotechnology, and renewable energy solutions.",
                "Stay updated with tech news to learn about the latest breakthroughs and innovations."
            ]
        },
        {
            "tag": "sustainability",
            "patterns": [
                "sustainability"
            ],
            "responses": [
                "Sustainability aims to meet current needs without compromising the ability of future generations to meet their needs.",
                "Adopting eco-friendly practices, reducing waste, and supporting sustainable products contribute to a greener planet."
            ]
        },
        {
            "tag": "machine_learning",
            "patterns": [
                "machine learning"
            ],
            "responses": [
                "Machine learning is a subset of AI that enables systems to learn from data and improve performance over time.",
                "ML has applications in image recognition, natural language processing, recommendation systems, and predictive analytics."
            ]
        },
        {
            "tag": "depression",
            "patterns": [
                "depression"
            ],
            "responses": [
                "Depression is a mental health disorder characterized by persistent sadness, loss of interest, and changes in behavior and mood.",
                "Supporting someone with depression involves offering empathy, listening without judgment, and encouraging professional help."
            ]
        },
        {
            "tag": "nanotechnology",
            "patterns": [
                "nanotechnology",
                "nanotech"
            ],
            "responses": [
                "Nanotechnology involves manipulating materials and structures at the nanoscale, often on the atomic or molecular level.",
                "Nanotechnology has applications in medicine, electronics, energy, and environmental remediation."
            ]
        },
        {
            "tag": "virtual_currency",
            "patterns": [
                "virtual currencies"
            ],
            "responses": [
                "Virtual currencies like Bitcoin are decentralized digital assets that operate on blockchain technology.",
                "Blockchain offers benefits such as transparency, security, reduced intermediaries, and potential applications beyond finance."
            ]
        },
        {
            "tag": "biomedical_engineering",
            "patterns": [
                "biomedical engineering"
            ],
            "responses": [
                "Biomedical engineering applies principles of engineering and technology to solve medical and healthcare challenges.",
                "Medical innovations in biomedical engineering include prosthetics, medical imaging, regenerative medicine, and medical devices."
            ]
        },
        {
            "tag": "quantum_entanglement",
            "patterns": [
                "quantum entanglement"
            ],
            "responses": [
                "Quantum entanglement is a quantum phenomenon where two or more particles become connected and behave as one, even when separated by great distances.",
                "Applications of quantum entanglement include quantum computing, quantum teleportation, and quantum communication."
            ]
        },
        {
            "tag": "books",
            "patterns": [
                "Recommend book"
            ],
            "responses": [
                "Reading is a great way to expand your knowledge and imagination. Some popular genres include fiction, non-fiction, mystery, fantasy, and romance.",
                "Books can transport you to different worlds, teach valuable lessons, and inspire personal growth."
            ]
        },
        {
            "tag": "movies",
            "patterns": [
                "movie"
            ],
            "responses": [
                "Movies offer a wide variety of genres, such as action, comedy, drama, thriller, sci-fi, and horror.",
                "Watching movies can be a fun and entertaining way to relax and unwind."
            ]
        },
        {
            "tag": "workout",
            "patterns": [
                "workout routines"
            ],
            "responses": [
                "Workout routines can include cardio, strength training, yoga, and HIIT workouts. Find one that suits your fitness goals and preferences.",
                "Staying motivated for workouts can be easier when you set achievable goals, track progress, and find a workout buddy for accountability."
            ]
        },
        {
            "tag": "time_management",
            "patterns": [
                "time management"
            ],
            "responses": [
                "Time management techniques include creating to-do lists, using time blocks, and setting specific goals.",
                "To stay productive, identify your most productive hours, eliminate distractions, and take regular breaks."
            ]
        },
        {
            "tag": "online_security",
            "patterns": [
                "online security"
            ],
            "responses": [
                "Online security tips include using strong passwords, enabling two-factor authentication, and avoiding public Wi-Fi for sensitive transactions.",
                "To protect children online, use parental control software, educate them about online safety, and monitor their online activities."
            ]
        },
        {
            "tag": "time_for_yourself",
            "patterns": [
                "time for yourself"
            ],
            "responses": [
                "Making time for yourself is essential for mental well-being. Set aside moments for relaxation, hobbies, or simply doing nothing.",
                "Self-care involves nurturing your physical, emotional, and mental health to maintain balance and prevent burnout."
            ]
        },
        {
            "tag": "volunteering",
            "patterns": [
                "volunteering"
            ],
            "responses": [
                "Volunteering opportunities can be found in local organizations, shelters, and community events.",
                "Volunteering not only helps others but also gives you a sense of purpose and fulfillment."
            ]
        },
        {
            "tag": "public_speaking",
            "patterns": [
                "public speaking"
            ],
            "responses": [
                "Public speaking tips include practicing, knowing your audience, and using visual aids to enhance your presentation.",
                "To overcome stage fright, visualize success, practice deep breathing, and start with smaller speaking engagements."
            ]
        },
        {
            "tag": "healthy_sleep",
            "patterns": [
                " healthy sleep"
            ],
            "responses": [
                "Healthy sleep habits include having a consistent sleep schedule, creating a relaxing bedtime routine, and ensuring a comfortable sleep environment.",
                "Improving sleep quality can enhance mood, memory, and overall well-being."
            ]
        },
        {
            "tag": "self_defense",
            "patterns": [
                "self-defense"
            ],
            "responses": [
                "Self-defense techniques involve learning basic strikes, blocks, and using your voice to create distance from potential threats.",
                "Staying safe in public places can involve being aware of your surroundings, avoiding isolated areas, and trusting your instincts."
            ]
        },
        {
            "tag": "leadership_skills",
            "patterns": [
                "leadership skills"
            ],
            "responses": [
                "Developing leadership skills involves continuous learning, setting a positive example, and empowering others.",
                "To lead a team effectively, communicate clearly, delegate tasks, and foster a collaborative and inclusive environment."
            ]
        },
        {
            "tag": "job_search",
            "patterns": [
                "job search"
            ],
            "responses": [
                "Job search strategies include networking, attending job fairs, and using online job boards.",
                "A compelling resume highlights relevant skills, experiences, and achievements. LinkedIn can be a valuable tool for connecting with potential employers."
            ]
        },
        {
            "tag": "goal_setting",
            "patterns": [
                "achieving goals"
            ],
            "responses": [
                "Setting specific, measurable, achievable, relevant, and time-bound (SMART) goals increases the likelihood of success.",
                "Breaking down big goals into smaller tasks makes them more manageable and provides a sense of progress."
            ]
        },
        {
            "tag": "technology_addiction",
            "patterns": [
                "technology addiction"
            ],
            "responses": [
                "Managing technology addiction involves setting designated tech-free times, using screen time trackers, and finding alternative activities.",
                "Setting boundaries with digital devices can improve sleep, productivity, and overall well-being."
            ]
        },
        {
            "tag": "plastic_waste_reduction",
            "patterns": [
                "plastic waste"
            ],
            "responses": [
                "Reducing plastic waste can be achieved by using reusable water bottles, shopping bags, and containers.",
                "Recycling plastic reduces the amount of plastic pollution and conserves natural resources."
            ]
        },
        {
            "tag": "online_business",
            "patterns": [
                "online business",
                "e-commerce website"
            ],
            "responses": [
                "Starting an online business involves identifying a niche, creating a business plan, and choosing an e-commerce platform.",
                "Building an e-commerce website requires user-friendly design, secure payment options, and product descriptions."
            ]
        },
        {
            "tag": "eco-friendly_transportation",
            "patterns": [
                "eco-friendly transportation",
                "cycling",
                "walking",
                "public transport"
            ],
            "responses": [
                "Eco-friendly transportation options include cycling, walking, using public transportation, or carpooling.",
                "Cycling or walking benefits the environment and promotes physical activity."
            ]
        },
        {
            "tag": "digital_organization",
            "patterns": [
                "organizing digital flies",
                "Backup and data protection"
            ],
            "responses": [
                "Organizing digital files involves creating folders, using descriptive file names, and decluttering regularly.",
                "Backing up data is crucial to prevent data loss in case of hardware failure or accidents."
            ]
        },
        {
            "tag": "emotional_intelligence",
            "patterns": [
                "emotional intelligence"
            ],
            "responses": [
                "Emotional intelligence involves understanding and managing emotions in oneself and others.",
                "Developing emotional intelligence can lead to better communication, empathy, and healthier relationships."
            ]
        },
        {
            "tag": "home_security",
            "patterns": [
                "home security"
            ],
            "responses": [
                "Home security measures include installing locks, security cameras, and motion sensor lights.",
                "A security system can provide peace of mind and deter potential intruders."
            ]
        },
        {
            "tag": "memory_improvement",
            "patterns": [
                "memory improvement"
            ],
            "responses": [
                "Memory improvement techniques include visualization, association, and regular mental exercises.",
                "Practicing brain exercises, like puzzles or memory games, can sharpen cognitive abilities."
            ]
        },
        {
            "tag": "interpersonal_skills",
            "patterns": [
                "interpersonal skills"
            ],
            "responses": [
                "Interpersonal skills involve active listening, empathy, and adaptability in social interactions.",
                "Improving communication skills can enhance relationships and minimize misunderstandings."
            ]
        },
        {
            "tag": "reducing_energy_consumption",
            "patterns": [
                "reducing energy consumption"
            ],
            "responses": [
                "Reducing energy consumption involves using energy-efficient appliances, turning off lights when not in use, and properly insulating your home.",
                "Energy conservation helps lower utility bills and reduces the environmental impact."
            ]
        },
        {
            "tag": "self_defense_for_women",
            "patterns": [
                "self-defense for women"
            ],
            "responses": [
                "Self-defense for women involves learning techniques to protect oneself and create a sense of empowerment.",
                "Safety tips for women include being aware of surroundings, trusting instincts, and avoiding risky situations."
            ]
        },
        {
            "tag": "daily_meditation",
            "patterns": [
                "meditation"
            ],
            "responses": [
                "Daily meditation practice involves setting aside time each day for quiet reflection, mindfulness, or deep breathing exercises.",
                "Regular meditation can reduce stress, improve mental clarity, and enhance overall well-being."
            ]
        },
        {
            "tag": "charity_donations",
            "patterns": [
                "charity donations"
            ],
            "responses": [
                "Charity donations support various causes, such as education, health, environmental conservation, and humanitarian aid.",
                "Before donating, research and verify the legitimacy and impact of the charity organization."
            ]
        },
        {
            "tag": "meal_preparation",
            "patterns": [
                "meal preparation"
            ],
            "responses": [
                "Meal preparation tips include planning meals, batch cooking, and using reusable meal containers.",
                "Meal prepping saves time, reduces food waste, and promotes healthier eating habits."
            ]
        },
        {
            "tag": "work_life_balance",
            "patterns": [
                "work-life balance"
            ],
            "responses": [
                "Achieving work-life balance involves prioritizing personal time, setting boundaries, and knowing when to take breaks.",
                "Self-care is essential for maintaining balance and preventing burnout."
            ]
        },
        {
            "tag": "mindfulness_in_nature",
            "patterns": [
                "nature"
            ],
            "responses": [
                "Mindfulness in nature involves being present and fully experiencing the sights, sounds, and sensations of the natural environment.",
                "Nature meditation can reduce stress and foster a deeper connection with the outdoors."
            ]
        },
        {
            "tag": "journaling",
            "patterns": [
                "journaling"
            ],
            "responses": [
                "Journaling benefits include stress relief, self-reflection, and gaining insights into thoughts and emotions.",
                "Starting a journaling practice can involve writing freely, using prompts, or maintaining a gratitude journal."
            ]
        },
        {
            "tag": "reducing_single_use_plastics",
            "patterns": [
                "plastics"
            ],
            "responses": [
                "Reducing single-use plastics involves using reusable water bottles, coffee cups, and shopping bags.",
                "Supporting plastic-free initiatives and advocating for sustainable practices can drive positive change."
            ]
        },
        {
            "tag": "team_building",
            "patterns": [
                "team-building"
            ],
            "responses": [
                "Team-building activities can include team retreats, problem-solving exercises, and icebreaker games.",
                "Fostering a positive team dynamic requires open communication, trust, and recognizing individual strengths."
            ]
        },
        {
            "tag": "financial_investing",
            "patterns": [
                "financial investing"
            ],
            "responses": [
                "Financial investing involves putting money into assets like stocks, bonds, and mutual funds with the expectation of generating returns over time.",
                "Diversifying your investment portfolio can help manage risk and optimize returns."
            ]
        },
        {
            "tag": "reusable_transportation",
            "patterns": [
                "reusable transportation"
            ],
            "responses": [
                "Using reusable transportation, like cycling or walking, reduces carbon emissions and promotes physical fitness.",
                "Car-sharing and ride-sharing services provide convenient alternatives to private car ownership."
            ]
        },
        {
            "tag": "exploring_culture_and_traditions",
            "patterns": [
                "cultures and traditions"
            ],
            "responses": [
                "Exploring different cultures and traditions can broaden perspectives, foster empathy, and promote tolerance and understanding.",
                "Embracing diversity enriches communities and allows for a greater appreciation of the world."
            ]
        },
        {
            "tag": "developing_creativity_in_children",
            "patterns": [
                "children"
            ],
            "responses": [
                "Developing creativity in children involves encouraging imaginative play, providing art supplies, and fostering curiosity and exploration.",
                "Art and craft activities can enhance fine motor skills, self-expression, and cognitive development.",
                "Fostering emotional resilience in children involves validating their feelings, teaching problem-solving, and helping them develop a growth mindset.",
                "A supportive and nurturing environment at home and school contributes to emotional well-being."
            ]
        },
        {
            "tag": "self_reflection",
            "patterns": [
                "self-reflection"
            ],
            "responses": [
                "Self-reflection is essential for gaining self-awareness, identifying strengths and areas for growth, and making positive changes in life.",
                "Journaling can be a powerful tool for self-discovery, emotional processing, and goal-setting."
            ]
        },
        {
            "tag": "mindful_technology_usage",
            "patterns": [
                "technology usage"
            ],
            "responses": [
                "Mindful technology usage involves being intentional with screen time, setting boundaries, and using technology in ways that support well-being.",
                "Balancing screen time with real-world experiences fosters social connections and reduces digital overwhelm."
            ]
        },
        {
            "tag": "youth_mental_health",
            "patterns": [
                "mental health"
            ],
            "responses": [
                "Youth mental health is crucial for overall well-being and requires understanding, support, and open communication.",
                "Supporting teenagers' emotional well-being involves being approachable, validating their feelings, and encouraging help-seeking behavior when needed."
            ]
        },
        {
            "tag": "effective_study_groups",
            "patterns": [
                "study groups"
            ],
            "responses": [
                "Effective study groups can enhance learning through peer discussions, explaining concepts to others, and sharing study resources.",
                "Setting study goals as a team and holding each other accountable can lead to improved academic performance."
            ]
        },
        {
            "tag": "social_anxiety",
            "patterns": [
                "social anxiety"
            ],
            "responses": [
                "Coping with social anxiety involves challenging negative thoughts, gradual exposure to social situations, and learning relaxation techniques to manage anxiety symptoms.",
                "For severe social anxiety or anxiety disorders, seeking professional support, such as therapy or counseling, can be beneficial."
            ]
        },
        {
            "tag": "gardening",
            "patterns": [
                "gardening"
            ],
            "responses": [
                "Gardening can be a fulfilling hobby that allows you to connect with nature, grow your own food, and create beautiful landscapes.",
                "Growing herbs and vegetables at home provides fresh and nutritious produce for your meals."
            ]
        },
        {
            "tag": "waste_reduction_at_work",
            "patterns": [
                "waste reduction at work"
            ],
            "responses": [
                "Waste reduction at work involves promoting recycling, minimizing paper usage, and encouraging employees to adopt sustainable practices.",
                "Implementing sustainable practices, like energy-efficient lighting and reducing single-use plastics, can contribute to a greener workplace."
            ]
        },
        {
            "tag": "effective_decision_making",
            "patterns": [
                "effective decision-making"
            ],
            "responses": [
                "Effective decision-making involves gathering information, weighing pros and cons, and considering the potential outcomes.",
                "Trusting intuition in decision-making can be valuable, especially when facing complex choices."
            ]
        },
        {
            "tag": "fantastical_architecture",
            "patterns": [
                "rchitecture",
                "structures"
            ],
            "responses": [
                "Fantastical architecture is an artistic expression that pushes the boundaries of imagination, creating whimsical and surreal buildings.",
                "Architects and designers explore innovative ideas to shape the future of urban living."
            ]
        },
        {
            "tag": "timeless_tales",
            "patterns": [
                "timeless tales"
            ],
            "responses": [
                "Timeless tales are enduring narratives that transcend time and continue to captivate audiences across generations.",
                "Storytelling is a powerful form of communication and cultural preservation."
            ]
        },
        {
            "tag": "spellbinding_cuisine",
            "patterns": [
                "cuisine",
                "Food"
            ],
            "responses": [
                "Spellbinding cuisine is an imaginative concept where food is prepared with magical ingredients and flavors.",
                "Cooking and culinary arts offer diverse tastes and cultural experiences."
            ]
        },
        {
            "tag": "enchanted_lullabies",
            "patterns": [
                "enchanted lullabies",
                "bedtime melodies"
            ],
            "responses": [
                "Enchanted lullabies are mythical songs that have a soothing and magical effect, lulling listeners into a peaceful slumber.",
                "Lullabies are cherished melodies that parents sing to their children to comfort and calm them."
            ]
        },
        {
            "tag": "time_travelers_journal",
            "patterns": [
                "time travel"
            ],
            "responses": [
                "A time traveler's journal is a fictional account documenting journeys through different historical periods and possibly into the future.",
                "Historical records, memoirs, and diaries provide valuable insights into the past."
            ]
        },
        {
            "tag": "enchanted_riddles",
            "patterns": [
                "riddles",
                "hidden treasures",
                "mythical riddles"
            ],
            "responses": [
                "Enchanted riddles are puzzles that challenge the mind and are often associated with quests and adventures in folklore and fantasy tales.",
                "Riddles have been used for entertainment and intellectual stimulation throughout history."
            ]
        },
        {
            "tag": "timeless_relics",
            "patterns": [
                "timeless relics",
                "lost civilizations",
                "ancient mysteries"
            ],
            "responses": [
                "Timeless relics are ancient artifacts and objects that hold historical and cultural significance, preserving the stories of our ancestors.",
                "Archaeologists and historians continue to unearth relics that shed light on human history and civilization."
            ]
        },
        {
            "tag": "1",
            "patterns": [
                "Constitution"
            ],
            "responses": [
                "The Constitution of India is the supreme law of the country, defining its political principles and government structure."
            ]
        },
        {
            "tag": "2",
            "patterns": [
                " Fundamental Rights Constitution"
            ],
            "responses": [
                "Fundamental Rights are a set of basic individual rights, including the right to equality, right to freedom, right against exploitation, right to freedom of religion, cultural and educational rights, and right to constitutional remedies."
            ]
        },
        {
            "tag": "3",
            "patterns": [
                "significance of Article 32"
            ],
            "responses": [
                "Article 32 allows individuals to directly approach the Supreme Court for the enforcement of Fundamental Rights."
            ]
        },
        {
            "tag": "4",
            "patterns": [
                " Directive Principles State Policy"
            ],
            "responses": [
                "Directive Principles are guidelines for the government to promote social and economic justice in India."
            ]
        },
        {
            "tag": "5",
            "patterns": [
                " Rule of Law meaning jurisprudence"
            ],
            "responses": [
                "The 'Rule of Law' means that no one is above the law, and everyone, including the government, is subject to the law."
            ]
        },
        {
            "tag": "6",
            "patterns": [
                " Public Interest Litigation ",
                "PIL"
            ],
            "responses": [
                "Public Interest Litigation (PIL) is a legal action initiated in the public interest to seek justice for a large group or the general public."
            ]
        },
        {
            "tag": "7",
            "patterns": [
                "Chief Justice"
            ],
            "responses": [
                "The Chief Justice of India, as of my last update in September 2021, was N.V. Ramana."
            ]
        },
        {
            "tag": "8",
            "patterns": [
                "Indian Penal Code",
                "IPC"
            ],
            "responses": [
                "The Indian Penal Code (IPC) is a criminal code of India that defines various offenses and their penalties."
            ]
        },
        {
            "tag": "9",
            "patterns": [
                " murder",
                "commit murder crime",
                "murder punishment"
            ],
            "responses": [
                "In most cases, the punishment for murder in India is life imprisonment."
            ]
        },
        {
            "tag": "10",
            "patterns": [
                "Right to Information Act ",
                "RTI"
            ],
            "responses": [
                "The Right to Information Act (RTI) is an act that empowers citizens to seek information from public authorities to promote transparency and accountability."
            ]
        },
        {
            "tag": "11",
            "patterns": [
                "legal drinking "
            ],
            "responses": [
                "The legal drinking age varies from state to state in India, typically ranging from 18 to 25 years."
            ]
        },
        {
            "tag": "12",
            "patterns": [
                "Juvenile Justice Act"
            ],
            "responses": [
                "The Juvenile Justice Act deals with the care and protection of children in conflict with the law."
            ]
        },
        {
            "tag": "13",
            "patterns": [
                "dowry harassment "
            ],
            "responses": [
                "Dowry harassment is punishable under Section 498A of the IPC, and the punishment can include imprisonment."
            ]
        },
        {
            "tag": "14",
            "patterns": [
                "Supreme Court "
            ],
            "responses": [
                "The Supreme Court is the highest judicial authority in India, responsible for interpreting the Constitution and ensuring justice."
            ]
        },
        {
            "tag": "15",
            "patterns": [
                "difference between civil and criminal law"
            ],
            "responses": [
                "Civil law deals with disputes between individuals or entities, while criminal law addresses offenses against the state."
            ]
        },
        {
            "tag": "16",
            "patterns": [
                "sedition law"
            ],
            "responses": [
                "Sedition involves any act or attempt to incite violence, public disorder, or rebellion against the government."
            ]
        },
        {
            "tag": "17",
            "patterns": [
                "sedition "
            ],
            "responses": [
                "The punishment for sedition can include imprisonment and fines, as per Section 124A of the IPC."
            ]
        },
        {
            "tag": "18",
            "patterns": [
                "National Human Rights Commission",
                "NHRC"
            ],
            "responses": [
                "NHRC is responsible for promoting and protecting human rights in India."
            ]
        },
        {
            "tag": "19",
            "patterns": [
                "rape India"
            ],
            "responses": [
                "The punishment for rape in India includes imprisonment, which may extend to life imprisonment or even the death penalty."
            ]
        },
        {
            "tag": "20",
            "patterns": [
                "Article 370 Constitution"
            ],
            "responses": [
                "Article 370 granted special autonomy to the state of Jammu and Kashmir, but it was revoked in 2019."
            ]
        },
        {
            "tag": "21",
            "patterns": [
                "Indian Evidence Act"
            ],
            "responses": [
                "The Indian Evidence Act is a law that governs the admissibility of evidence in Indian courts."
            ]
        },
        {
            "tag": "22",
            "patterns": [
                "Legal Services Authority Act"
            ],
            "responses": [
                "The Legal Services Authority Act provides for free legal services to the needy and promotes justice."
            ]
        },
        {
            "tag": "23",
            "patterns": [
                "Attorney General"
            ],
            "responses": [
                "The Attorney General of India is the chief legal advisor to the government of India."
            ]
        },
        {
            "tag": "24",
            "patterns": [
                "contempt of court "
            ],
            "responses": [
                "Contempt of court includes any act that disobeys or insults the authority of a court.",
                "The punishment for contempt of court can include fines or imprisonment."
            ]
        },
        {
            "tag": "26",
            "patterns": [
                "National Legal Services Authority",
                "NALSA"
            ],
            "responses": [
                "NALSA is responsible for providing legal aid and services to marginalized and underprivileged communities."
            ]
        },
        {
            "tag": "27",
            "patterns": [
                "Motor Vehicles Act"
            ],
            "responses": [
                "The Motor Vehicles Act governs the use and regulation of motor vehicles in India."
            ]
        },
        {
            "tag": "28",
            "patterns": [
                "Education Act"
            ],
            "responses": [
                "The Right to Education Act ensures free and compulsory education for children aged 6 to 14."
            ]
        },
        {
            "tag": "29",
            "patterns": [
                "custodial torture "
            ],
            "responses": [
                "Custodial torture refers to the use of physical or mental force by law enforcement officials on individuals in custody.",
                "ustodial torture is a crime, and the punishment can include imprisonment."
            ]
        },
        {
            "tag": "31",
            "patterns": [
                "Prevention Corruption Act"
            ],
            "responses": [
                "The Prevention of Corruption Act deals with the prosecution of public servants involved in corrupt practices."
            ]
        },
        {
            "tag": "32",
            "patterns": [
                "First Information Report",
                "FIR"
            ],
            "responses": [
                "An FIR can be filed at a police station by any person who has knowledge of a cognizable offense."
            ]
        },
        {
            "tag": "33",
            "patterns": [
                "intellectual property rights "
            ],
            "responses": [
                "India has laws like the Copyright Act, Trademarks Act, and Patents Act to protect intellectual property."
            ]
        },
        {
            "tag": "34",
            "patterns": [
                "National Commission Women",
                "NCW"
            ],
            "responses": [
                "NCW works for the protection and promotion of women's rights in India."
            ]
        },
        {
            "tag": "35",
            "patterns": [
                "domestic violence"
            ],
            "responses": [
                "Domestic violence can lead to legal action under the Protection of Women from Domestic Violence Act, and the punishment may include restraining orders and fines."
            ]
        },
        {
            "tag": "36",
            "patterns": [
                "73rd and 74th Amendments"
            ],
            "responses": [
                "The 73rd and 74th Amendments provide for the establishment of Panchayats and Municipalities for local self-governance."
            ]
        },
        {
            "tag": "37",
            "patterns": [
                "Indian Copyright Act"
            ],
            "responses": [
                "The Indian Copyright Act protects the rights of creators of literary, artistic, and musical works."
            ]
        },
        {
            "tag": "38",
            "patterns": [
                "legal age for marriage "
            ],
            "responses": [
                "The legal age for marriage is 18 for females and 21 for males."
            ]
        },
        {
            "tag": "39",
            "patterns": [
                "cybercrime  law"
            ],
            "responses": [
                "Cybercrime involves illegal activities committed using computers or computer networks."
            ]
        },
        {
            "tag": "40",
            "patterns": [
                "cyberbullying "
            ],
            "responses": [
                "Cyberbullying can be punishable under various sections of the IPC, and the punishment can include imprisonment."
            ]
        },
        {
            "tag": "41",
            "patterns": [
                "National Commission for Scheduled Castes",
                "NCSC"
            ],
            "responses": [
                "NCSC works to safeguard the rights and interests of Scheduled Castes in India."
            ]
        },
        {
            "tag": "42",
            "patterns": [
                "National Green Tribunal",
                "NGT"
            ],
            "responses": [
                "NGT is a specialized tribunal that deals with environmental disputes and issues."
            ]
        },
        {
            "tag": "44",
            "patterns": [
                "public interest litigant"
            ],
            "responses": [
                "A public interest litigant is an individual who files a lawsuit on behalf of the public or a specific community to address a broader issue of public interest."
            ]
        },
        {
            "tag": "45",
            "patterns": [
                "difference between civil and criminal"
            ],
            "responses": [
                "A civil lawsuit deals with disputes between individuals or entities, seeking remedies such as compensation or specific performance. A criminal lawsuit involves offenses against the state, with penalties like fines or imprisonment."
            ]
        },
        {
            "tag": "46",
            "patterns": [
                "registering a trademark "
            ],
            "responses": [
                "To register a trademark in India, one must file an application with the Trademarks Registry, undergo examination, and if approved, the trademark is registered for a specified period."
            ]
        },
        {
            "tag": "47",
            "patterns": [
                "National Commission for Backward Classes",
                "NCBC"
            ],
            "responses": [
                "The National Commission for Backward Classes (NCBC) identifies and recommends measures for the welfare of socially and educationally backward classes."
            ]
        },
        {
            "tag": "48",
            "patterns": [
                "human trafficking "
            ],
            "responses": [
                "Human trafficking is punishable under various sections of the Indian Penal Code (IPC) and other specific laws, with penalties including imprisonment."
            ]
        },
        {
            "tag": "49",
            "patterns": [
                "adopting a child "
            ],
            "responses": [
                "Adoption in India is regulated by the Juvenile Justice (Care and Protection of Children) Act, and it involves a legal process that includes adoption agencies, the Child Welfare Committee, and the court."
            ]
        },
        {
            "tag": "50",
            "patterns": [
                "42nd Amendment Constitution"
            ],
            "responses": [
                "The 42nd Amendment to the Indian Constitution made significant changes, including adding the term 'secular' to the Preamble and expanding the powers of the Parliament."
            ]
        },
        {
            "tag": "51",
            "patterns": [
                "drug possession "
            ],
            "responses": [
                "Drug possession is illegal, and the punishment can vary based on the type and quantity of the drug, but it can include imprisonment."
            ]
        },
        {
            "tag": "52",
            "patterns": [
                "divorce "
            ],
            "responses": [
                "Divorce in India is governed by personal laws for different religions, and the process involves filing a divorce petition, mediation, and court proceedings."
            ]
        },
        {
            "tag": "53",
            "patterns": [
                "Central Bureau of Investigation",
                "CBI"
            ],
            "responses": [
                "The CBI is India's premier investigating agency, responsible for probing complex and high-profile cases, including corruption and major crimes."
            ]
        },
        {
            "tag": "54",
            "patterns": [
                "acid attacks "
            ],
            "responses": [
                "Acid attacks are punishable under various sections of the IPC, and the punishment can include imprisonment and fines."
            ]
        },
        {
            "tag": "55",
            "patterns": [
                "registering a marriage "
            ],
            "responses": [
                "Marriage registration in India involves submitting an application along with required documents to the local Registrar of Marriages."
            ]
        },
        {
            "tag": "56",
            "patterns": [
                "public nuisance law"
            ],
            "responses": [
                "A public nuisance refers to any act or omission that causes inconvenience, harm, or damage to the public or a community."
            ]
        },
        {
            "tag": "57",
            "patterns": [
                "public nuisance"
            ],
            "responses": [
                "The punishment for a public nuisance can vary depending on the nature and severity of the act, and it may include fines or imprisonment."
            ]
        },
        {
            "tag": "58",
            "patterns": [
                "Mandal Commission"
            ],
            "responses": [
                "The Mandal Commission recommended reservations for Other Backward Classes (OBCs) in government jobs and educational institutions, leading to policy changes in India."
            ]
        },
        {
            "tag": "59",
            "patterns": [
                "passport "
            ],
            "responses": [
                "To obtain a passport in India, one must apply through the Passport Seva Kendra, provide necessary documents, pay the required fee, and undergo verification."
            ]
        },
        {
            "tag": "60",
            "patterns": [
                "human rights violations "
            ],
            "responses": [
                "Human rights violations can lead to legal action, including compensation to victims, and the specific punishment depends on the nature of the violation."
            ]
        },
        {
            "tag": "61",
            "patterns": [
                "changing one's name "
            ],
            "responses": [
                "To legally change one's name in India, an individual must apply through a deed poll or a gazette notification and follow the required legal process."
            ]
        },
        {
            "tag": "62",
            "patterns": [
                "National Commission for Backward Classes",
                "NCBC"
            ],
            "responses": [
                "The National Commission for Backward Classes (NCBC) identifies and recommends measures for the welfare of socially and educationally backward classes."
            ]
        },
        {
            "tag": "66",
            "patterns": [
                "registering non-governmental organization",
                "registering NGO"
            ],
            "responses": [
                "To register an NGO in India, one must follow the guidelines provided by the Ministry of Home Affairs and fulfill the necessary documentation and registration requirements."
            ]
        },
        {
            "tag": "67",
            "patterns": [
                "National Commission for Protection of Child Rights",
                "NCPCR"
            ],
            "responses": [
                "NCPCR is responsible for promoting and protecting the rights of children in India."
            ]
        },
        {
            "tag": "68",
            "patterns": [
                "sexual harassment"
            ],
            "responses": [
                "Sexual harassment at the workplace is punishable under the Sexual Harassment of Women at Workplace (Prevention, Prohibition, and Redressal) Act, and the punishment can include penalties and legal action."
            ]
        },
        {
            "tag": "69",
            "patterns": [
                "gun license "
            ],
            "responses": [
                "Obtaining a gun license in India involves applying to the local licensing authority, meeting eligibility criteria, and undergoing background checks."
            ]
        },
        {
            "tag": "70",
            "patterns": [
                "cyberstalking "
            ],
            "responses": [
                "Cyberstalking is punishable under various sections of the IPC and the Information Technology Act, with penalties that may include imprisonment."
            ]
        },
        {
            "tag": "71",
            "patterns": [
                "environmental violations"
            ],
            "responses": [
                "Environmental violations can be reported to the relevant pollution control boards or agencies, and action can be taken under environmental laws."
            ]
        },
        {
            "tag": "72",
            "patterns": [
                "female foeticide"
            ],
            "responses": [
                "Female foeticide is illegal, and those involved can face legal action, including imprisonment."
            ]
        },
        {
            "tag": "73",
            "patterns": [
                "National Legal Services Authority",
                "NALSA"
            ],
            "responses": [
                "NALSA works to provide free legal services to marginalized and disadvantaged groups in India."
            ]
        },
        {
            "tag": "74",
            "patterns": [
                "honor killings"
            ],
            "responses": [
                "Honor killings are considered murder and are punishable under the Indian Penal Code, with penalties that may include life imprisonment or the death penalty."
            ]
        },
        {
            "tag": "75",
            "patterns": [
                "Right to Information (RTI)",
                "RTI"
            ],
            "responses": [
                "To file an RTI application, one needs to address it to the relevant public information officer, pay the required fee, and submit the application either physically or online."
            ]
        },
        {
            "tag": "76",
            "patterns": [
                "custodial deaths"
            ],
            "responses": [
                "Custodial deaths are subject to investigation, and those found responsible can face legal action, including imprisonment."
            ]
        },
        {
            "tag": "77",
            "patterns": [
                "National Commission for Safai Karamcharis",
                "NCSK"
            ],
            "responses": [
                "NCSK is responsible for the welfare and protection of sanitation workers in India."
            ]
        },
        {
            "tag": "78",
            "patterns": [
                "cyber fraud "
            ],
            "responses": [
                "Cyber fraud can be punishable under various sections of the IPC and the IT Act, with penalties that may include imprisonment and fines."
            ]
        },
        {
            "tag": "79",
            "patterns": [
                "police misconduct"
            ],
            "responses": [
                "Police misconduct can be reported to senior police officers, the State Human Rights Commission, or other oversight bodies."
            ]
        },
        {
            "tag": "80",
            "patterns": [
                "caste-based discrimination",
                "caste discrimination"
            ],
            "responses": [
                "Caste-based discrimination is illegal, and those found guilty can face legal action, including penalties and imprisonment."
            ]
        },
        {
            "tag": "81",
            "patterns": [
                "defamation",
                "defaming someone"
            ],
            "responses": [
                "To file a defamation case, one must draft a legal notice, file a complaint in court, and prove the elements of defamation."
            ]
        },
        {
            "tag": "82",
            "patterns": [
                "wildlife poaching"
            ],
            "responses": [
                "Wildlife poaching is a serious offense, and those involved can face imprisonment and fines under the Wildlife Protection Act."
            ]
        },
        {
            "tag": "83",
            "patterns": [
                "National Commission Protection of Privacy",
                "NCPP"
            ],
            "responses": [
                "As of my last update in September 2021, there was no National Commission for Protection of Privacy (NCPP) in India."
            ]
        },
        {
            "tag": "84",
            "patterns": [
                "human rights violations by the police",
                "misbehave done by police"
            ],
            "responses": [
                "Human rights violations by the police can lead to legal action, including suspension, dismissal, and criminal charges."
            ]
        },
        {
            "tag": "85",
            "patterns": [
                "consumer complaint",
                "customer complaint"
            ],
            "responses": [
                "Consumer complaints can be filed with the appropriate consumer forum or commission, depending on the value of the claim."
            ]
        },
        {
            "tag": "86",
            "patterns": [
                "illegal drug possession"
            ],
            "responses": [
                "Illegal drug possession can lead to legal action under the Narcotic Drugs and Psychotropic Substances Act, with penalties that may include imprisonment and fines."
            ]
        },
        {
            "tag": "87",
            "patterns": [
                "child labor",
                "underage workers"
            ],
            "responses": [
                "Child labor violations can be reported to the appropriate labor authorities or the National Child Labor Project (NCLP)."
            ]
        },
        {
            "tag": "88",
            "patterns": [
                "National Commission for Indigenous Peoples",
                "NCIP"
            ],
            "responses": [
                "As of my last update in September 2021, there was no National Commission for Indigenous Peoples (NCIP) in India."
            ]
        },
        {
            "tag": "89",
            "patterns": [
                "bribery ",
                "corruption"
            ],
            "responses": [
                "Bribery is illegal and can lead to legal action, including imprisonment and fines under various anti-corruption laws."
            ]
        },
        {
            "tag": "90",
            "patterns": [
                "workplace harassment"
            ],
            "responses": [
                "Workplace harassment complaints can be filed with the Internal Complaints Committee (ICC) or the Local Complaints Committee (LCC), as per the Sexual Harassment of Women at Workplace (Prevention, Prohibition, and Redressal) Act."
            ]
        },
        {
            "tag": "91",
            "patterns": [
                "online fraud",
                "internet fraud"
            ],
            "responses": [
                "Online fraud is punishable under various sections of the IPC and the IT Act, with penalties that may include imprisonment and fines."
            ]
        },
        {
            "tag": "92",
            "patterns": [
                "National Commission for Linguistic Minorities",
                "NCLM"
            ],
            "responses": [
                "The National Commission for Linguistic Minorities (NCLM) works to protect and promote the linguistic rights of minority communities in India."
            ]
        },
        {
            "tag": "93",
            "patterns": [
                "cyberbullying ",
                "cyber harassment"
            ],
            "responses": [
                "Cyberbullying can be punishable under various sections of the IPC and the IT Act, with penalties that may include imprisonment and fines."
            ]
        },
        {
            "tag": "94",
            "patterns": [
                "environmental violations ",
                "causing harm environment"
            ],
            "responses": [
                "Environmental violations can be reported to the relevant pollution control boards or agencies, and action can be taken under environmental laws."
            ]
        },
        {
            "tag": "95",
            "patterns": [
                "child marriage",
                "underage marriage"
            ],
            "responses": [
                "Child marriage is illegal in India, and the punishment can include imprisonment for those involved."
            ]
        },
        {
            "tag": "96",
            "patterns": [
                "corruption"
            ],
            "responses": [
                "Corruption can be reported to anti-corruption agencies, the Central Vigilance Commission, or online platforms like the Centralized Public Grievance Redress and Monitoring System (CPGRAMS)."
            ]
        },
        {
            "tag": "97",
            "patterns": [
                "organ trafficking"
            ],
            "responses": [
                "Human organ trafficking is a serious crime, and the punishment can include imprisonment and fines."
            ]
        },
        {
            "tag": "98",
            "patterns": [
                " non-governmental organization",
                "NGO"
            ],
            "responses": [
                "To register an NGO in India, one must follow the guidelines provided by the Ministry of Home Affairs and fulfill the necessary documentation and registration requirements."
            ]
        },
        {
            "tag": "99",
            "patterns": [
                "Child Rights",
                "NCPCR"
            ],
            "responses": [
                "NCPCR is responsible for promoting and protecting the rights of children in India."
            ]
        },
        {
            "tag": "100",
            "patterns": [
                "sexual harassment workplace ",
                "sexual harassment"
            ],
            "responses": [
                "Sexual harassment at the workplace is punishable under the Sexual Harassment of Women at Workplace (Prevention, Prohibition, and Redressal) Act, and the punishment can include penalties and legal action."
            ]
        },
        {
            "tag": "101",
            "patterns": [
                "link "
            ],
            "responses": [
                "https://google.com"
            ]
        },
        {
            "tag": "102",
            "patterns": [
                "legislative department"
            ],
            "responses": [
                "https://lddashboard.legislative.gov.in/"
            ]
        }
    ]
}
